# Pandas

In [2]:
import numpy as np
import pandas as pd

In [3]:
val = [23,43,23,43]
ind = ["faiz", "raza", "ali", "tayab"]

##### Creating Series form dictionary and value and indexs

In [4]:
ser = pd.Series(val, ind)
ser

faiz     23
raza     43
ali      23
tayab    43
dtype: int64

In [5]:
dic = {"faiz": 23, "raza": 23, "ali": 23, "raja": 243}
pd.Series(dic)

faiz     23
raza     23
ali      23
raja    243
dtype: int64

##### Creating dataframe form scratch and reading csv file

In [6]:
np.random.seed(23)
dat = np.random.randint(0, 100, (3,4))
dat

array([[83, 40, 73, 54],
       [31, 76, 91, 39],
       [90, 25, 51,  6]])

In [7]:
ind = ["faiz", "raza", "ali"]
col = ["feb", "dec", "jan", "Mar"]

In [8]:
pd.DataFrame(dat, ind, col)

      feb  dec  jan  Mar
faiz   83   40   73   54
raza   31   76   91   39
ali    90   25   51    6

In [9]:
df = pd.read_csv("movies.csv")
df

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
10324,146684,Cosmic Scrat-tastrophe (2015),Animation|Children|Comedy
10325,146878,Le Grand Restaurant (1966),Comedy
10326,148238,A Very Murray Christmas (2015),Comedy
10327,148626,The Big Short (2015),Drama
10328,149532,Marco Polo: One Hundred Eyes (2015),(no genres listed)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10329 entries, 0 to 10328
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  10329 non-null  int64
 1   title    10329 non-null  object
 2   genres   10329 non-null  object
dtypes: int64(1), object(2)
memory usage: 242.2+ KB

##### setting the index of the dataframe

In [15]:
df.set_index("movieId")

,title,genres
movieId,,
1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
2,Jumanji (1995),Adventure|Children|Fantasy
3,Grumpier Old Men (1995),Comedy|Romance
4,Waiting to Exhale (1995),Comedy|Drama|Romance
5,Father of the Bride Part II (1995),Comedy
...,...,...
146684,Cosmic Scrat-tastrophe (2015),Animation|Children|Comedy
146878,Le Grand Restaurant (1966),Comedy
148238,A Very Murray Christmas (2015),Comedy
148626,The Big Short (2015),Drama
149532,Marco Polo: One Hundred Eyes (2015),(no genres listed)